Switching to mermaid
