--- a/docs/.templates/view-template/view-template.md
+++ b/docs/.templates/view-template/view-template.md
@@ -2,52 +2,30 @@
-<!-- TODO: Might be a suitable way to replace the custom action with something a little easier to work with: https://gist.github.com/noamtamim/f11982b28602bd7e604c233fbe9d910f -->
-<details>
-<summary>View PlantUML</summary>
+```mermaid
+sequenceDiagram
+    actor Alice
+    actor Bob
+    actor Clare
+    actor Billy [[./billy.svg]]
 
-```plantuml:template-primary-representation
-@startuml Example
-actor Alice
-actor Bob
-actor Clare
-actor Billy [[./billy.svg]]
+    Alice -> Bob: Tell Clare "Hello!"
 
-Alice -> Bob: Tell Clare "Hello!"
+    activate Bob
+    Bob -> Clare: Alice says "Hello!"
 
-activate Bob
-Bob -> Clare: Alice says "Hello!"
+    activate Clare
+    Clare --> Bob: Hello, Alice!
+    deactivate Clare
 
-activate Clare
-Clare --> Bob: Hello, Alice!
-deactivate Clare
+    Bob --> Alice: Clare says "Hello, Alice!"
+    deactivate Bob
 
-Bob --> Alice: Clare says "Hello, Alice!"
-deactivate Bob
+    note over Alice: wait 10 mins
 
-note over Alice: wait 10 mins
-
-Alice ->(20) Clare: Texts "Hi again!"
-@enduml
+    Alice ->(20) Clare: Texts "Hi again!"
 ```
-
-```plantuml:billy
-@startuml
